конфигурация/Documents/ПриходнаяНакладная.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Document>
		<Properties>
			<Name>ПриходнаяНакладная</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Материалы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Материал</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

конфигурация/Documents/ПриходнаяНакладная/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте 
Процедура МатериалыКоличествоПриИзменении (Элемент)
СтрокаТабличнойЧасти = Элементы.Материалы.ТекущиеДанные; 
СтрокаТабличнойЧасти.Сумма = СтрокаТабличнойЧасти.Количество * СтрокаТабличнойЧасти.Цена; 
КонецПроцедуры

&НаКлиенте
Процедура МатериалыЦенаПриИзменении(Элемент)
СтрокаТабличнойЧасти = Элементы.Материалы.ТекущиеДанные; 
РаботаСДокументами.РассчитатьСумму(СтрокаТабличнойЧасти); 	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
  Если ТекущийОбъект.Склад.ЗапретОприходования = Истина Тогда
    Отказ = Истина; 
    Сообщение = Новый СообщениеПользователю;
    Сообщение.Текст = "Для данного склада создание приходных накладных запрещено!";
    Сообщение.Сообщить();  
  КонецЕсли;
  Если ТекущийОбъект.Склад.ДатаЗапретаОприходования <= Объект.Дата Тогда 
    Отказ = ТекущийОбъект.Склад.ДатаЗапретаОприходования <= Объект.Дата;
    Сообщение = Новый СообщениеПользователю;
    Сообщение.Текст = "Невозможно создание приходной накладной в указанную дату!";
    Сообщение.Сообщить();  
  КонецЕсли; 
  Если ТекущийОбъект.Склад.ЗапретОприходования = Истина и ТекущийОбъект.Склад.ДатаЗапретаОприходования = 0 Тогда
    Отказ = Истина;
    Отказ = 0;
    Сообщение = Новый СообщениеПользователю;
    Сообщение.Текст = "Не заполнено поле (Дата запрета оприходования)";
    Сообщение.Сообщить();
  КонецЕсли;
КонецПроцедуры
